We have a private repo that holds the usage of this module, but here are a couple of snippets with plans to demonstrate:

## Disabled

### `main.tf`
```hcl
module "example" {
  source = "../terraform-aws-imagebuilder-component-shell"

  name               = "test-component"
  create             = false
  component_version  = "1.0.0"
  change_description = null
  commands           = ["ls -al"]
}
```

### Plan
```bash
terraform plan
```
```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.this.data.aws_region.current: Refreshing state...
module.this.data.aws_caller_identity.current: Refreshing state...

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.
```

## Enabled

### `main.tf`
```hcl
module "example" {
  source = "../terraform-aws-imagebuilder-component-shell"

  name               = "test-component"
  create             = true
  component_version  = "1.0.0"
  change_description = null
  commands           = ["ls -al"]
}
```

### Plan
```bash
terraform plan
```
```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.this.data.aws_caller_identity.current: Refreshing state...
module.this.data.aws_region.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.this.aws_cloudformation_stack.this[0] will be created
  + resource "aws_cloudformation_stack" "this" {
      + id                 = (known after apply)
      + name               = (known after apply)
      + on_failure         = "ROLLBACK"
      + outputs            = (known after apply)
      + parameters         = (known after apply)
      + policy_body        = (known after apply)
      + tags               = {
          + "Name" = "test-component-stack"
        }
      + template_body      = <<~EOT
            Resources:
              ImageBuildComponent:
                Type: AWS::ImageBuilder::Component
                UpdateReplacePolicy: Retain
                Properties:
                  Name: test-component
                  Version: 1.0.0
                  Platform: Linux
                  Tags:
                    "Name": "test-component"
                  Data: |
                    name: test-component-document
                    schemaVersion: 1.0
                    phases:
                      - name: build
                        steps:
                          - name: arbitrary-script
                            action: ExecuteBash
                            inputs:
                              commands:
                                - "ls -al"
                    
            Outputs:
              ComponentArn:
                Description: ARN of the created component
                Value: !Ref "ImageBuildComponent"
        EOT
      + timeout_in_minutes = 10
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```